//
//  HelpViewController.swift
//  ios_vcanbuy
//
//  Created by 张志勇 on 2020/7/22.
//  Copyright © 2020 vcanbuy. All rights reserved.
//

import UIKit

class HelpViewController: UIViewController {
    
    override func viewDidLoad() {
        super.viewDidLoad()
        
        self.view.backgroundColor = UIColor.white
        
        let frame = self.view.bounds

        // 返回首页按钮
        let backBtn:UIButton = UIButton(frame: CGRect(x: 0, y: 50, width: 50, height: 30))
        backBtn.backgroundColor = UIColor.orange
        backBtn.setTitle("Back", for: .normal)
        backBtn.addTarget(self, action: #selector(backBtnAction), for: .touchUpInside)
        self.view.addSubview(backBtn)
        
        let scrollView = UIScrollView(frame: CGRect(x: 0, y: 100, width: frame.width, height: frame.height - 100))
        scrollView.contentSize = CGSize(width: frame.width, height: 5450)
        scrollView.backgroundColor = UIColor.white
        view.addSubview(scrollView)
        
        
        // 标题
        let titleLabel = UILabel(frame:  CGRect(x:0,
                                          y:50,
                                          width: CGFloat(frame.size.width),
                                          height: 50))

        titleLabel.text = "Vcanbuy"
        titleLabel.textColor = UIColor.black
        titleLabel.font = UIFont(name: "Arial-BoldMT", size: 20)
        titleLabel.textAlignment = .center
        scrollView.addSubview(titleLabel)
        
        // 文本
        let label = UILabel(frame:  CGRect(x:20,
                                           y:100,
                                           width: CGFloat(frame.size.width) - 40,
                                           height: CGFloat(5350)))

        let str = """
        ข้อตกลงและเงื่อนไขการใช้บริการ VCANBUY
        ข้อตกลงและเงื่อนไข อัปเดตล่าสุดวันที่ 7 มิ.ย. 62

        1.บริษัทฯเป็นเพียงผู้ช่วยในการสั่งซื้อสินค้าและนำเข้าสินค้าจากจีนให้กับลูกค้าเท่านั้น ดังนั้นทางเราไม่สามารถรับผิดชอบต่อความเสียหายของสินค้าในกรณีที่เกิดมาจากร้านค้าจีนได้ เช่น สินค้าผิดสี ผิดแบบ ได้รับอะไหล่ไม่ครบ หรืออื่นๆ เป็นต้น อย่างไรก็ตามทางเรายินดีช่วยประสานงานกับร้านค้าเพื่อทวงสิทธิ์และผลประโยชน์ให้กับลูกค้า

        2.การคิดค่าบริการ
        สำหรับลูกค้าระดับ Classic และ Gold จะมีค่าบริการในการเปิดออเดอร์ ดังนี้
          2.1 ลูกค้าระดับ Classic หากรายการสั่งซื้อ ยอดค่าสินค้าไม่ถึง 2000 บาท จะคิดค่าบริการ 5% จากค่าสินค้า  แต่หากรายการสั่งซื้อยอดค่าสินค้าเกิน 2000 บาท จะคิดค่าบริการเพียง 1%จากค่าสินค้า
          2.2 ลูกค้าระดับ Gold หากมีการเปิดรายการสั่งซื้อจะคิดค่าบริการ 1% จากค่าสินค้า

        3. บริษัทฯ ไม่มีนโยบายสนับสนุน “สินค้าละเมิดลิขสิทธิ์” และ “สินค้าห้ามนำเข้า” หากเกิดปัญหากับสินค้าดังกล่าว ทางบริษัทฯ จะไม่รับผิดชอบต่อความเสียหายที่เกิดขึ้นทุกกรณี

        4.สินค้าที่อยู่นอกเหนือความรับผิดชอบของบริษัทฯ และ ไม่รับเคลมทุกกรณี
        -สินค้าที่เสี่ยงต่อการแตกหักได้ง่าย  เช่น สินค้าประเภทขวด แก้ว กระจก เซรามิก พลาสติก หินอ่อน เครื่องสำอางหรือสินค้าที่มีส่วนประกอบของแก้ว กระเบื้อง กระจก ฯลฯ ทุกชนิด
        - สินค้าประเภทเฟอร์นิเจอร์ งานไม้ ซึ่งอาจมีรอยบุบรอยบิ่น หักหรือเกิดรอยขีดข่วนได้ขณะทำการขนส่ง รวมถึงกล่องบรรจุภัณฑ์อาจมีสภาพบุบบ้าง หากลูกค้าต้องการเพิ่มความปลอดภัยให้กับสินค้านั้น สามารถแจ้งตีลังไม้เพิ่มเติมหรือเปลี่ยนเป็นขนส่งทางเรือได้ก่อนการตัดจ่ายออเดอร์
        -สินค้าที่เกิดปัญหาจากธรรมชาติ เช่นการขึ้นรา ขึ้นสนิม การซีดจาง การละเหย การละลาย เป็นต้น
        -ความล่าช้าจากการขนส่ง ที่มีสาเหตุอันเนื่องมาจากวันหยุดยาว ความสุดวิสัยจาก ด่านตรวจเข้ม สงคราม การนัดหยุดงาน หรือความเสียหายที่เกิดจากภัยธรรมชาติ เช่น พายุ น้ำท่วม แผ่นดินไหว เป็นต้น
        -บรรจุภัณฑ์สินค้าด้านนอกเสียหายหรือบุบเล็กน้อย ซึ่งไม่มีผลต่อการใช้งานของสินค้า
        -สินค้าละเมิดลิขสิทธิ์ สินค้า /กล่อง /ป้ายคอ/ป้ายกระดาษ ที่มีคำว่า  MADE  IN  THAILAND，USA，UK ，JAPAN  ，KOREA  ของชาติต่าง ๆ รวมทั้งรูปธงชาติไทย
        - สินค้าห้ามนำเข้า เช่น โดรน อุปกรณ์สื่อสารทุกชนิด ยา เพชรพลอย เหรียญเงินตรา ธนาบัตร อาหารที่เป็นของเหลว พันธุ์พืช สัตว์เลี้ยง อาวุธ  สินค้าอัดแก็ส สินค้าไวไฟทุกชนิด สินค้าเกี่ยวกับ Sextoy สินค้าประเภทเครื่องดื่มแอลกอฮอล์ สินค้าประเภทยาสูบทุกประเภท  สินค้าเกี่ยวกับการพนันทุกชนิด ยางรถทุกประเภท

        5.บริษัทฯ จะทำการจัดซื้อสินค้าตามรายการที่ร้านค้ามีในตัวเลือกลิงก์เท่านั้น  กรณีที่ลูกค้าหมายเหตุสินค้าอื่นนอกเหนือจากตัวเลือกลิงก์ร้านค้ามา หากร้านค้าส่งสินค้ามาไม่ถูกต้อง ทางบริษัทฯ ขอไม่รับผิดชอบต่อรายการสั่งซื้อนั้น ๆ

        6.การตรวจสอบสินค้าของบริษัทฯ เป็นบริการเสริมโดยไม่มีค่าใช้จ่ายให้ลูกค้า โดยจะตรวจสอบ สี และจำนวนเท่านั้น ซึ่งเป็นการตรวจสอบสินค้าเบื้องต้น เพื่อช่วยลดความผิดพลาดของสินค้าที่ได้รับจากร้านค้าจีน
          การตรวจสอบจำนวน – ในกรณีที่สั่งสินค้าเกิน 100 ชิ้นขึ้นไปต่อร้านค้า ทางเจ้าหน้าที่จะไม่ทำการตรวจนับจำนวนสินค้า แต่จะทำการยืนยันจำนวนสินค้ากับทางร้านค้าเท่านั้น หากลูกค้าได้รับสินค้าไม่ครบ ทางบริษัทฯ ยินดีช่วยประสานงานกับทางร้านค้าให้อย่างเต็มความสามารถ แต่บริษัทฯ ไม่สามารถรับผิดชอบในกรณีดังกล่าวได้               การตรวจสอบสี – ในกรณีสีของสินค้าอยู่โทนแม่สีเดียวกัน  ถือว่าสีของสินค้านั้นถูกต้อง เช่น สีชมพูอ่อนและชมพูเข้ม ทางบริษัทฯจะพิจารณาว่าเป็นโทนสีชมพู และทางบริษัทฯ จะตรวจสอบสีของสินค้าโดยจะไม่เปิดบรรจุภัณฑ์ออกมาตรวจสอบรายละเอียดของสินค้า
         การตรวจสอบคุณภาพสินค้า – ทางบริษัทฯ จะไม่ตรวจสอบคุณภาพของสินค้าทุกชนิดประเภท ไม่ว่าจะเป็น คุณภาพของวัสดุหรือคุณภาพของการใช้งาน เช่น ได้รับเสื้อผ้าที่มีเนื้อผ้าไม่ตรงตามต้องการ หรือ ได้รับเครื่องใช้ไฟฟ้า แต่ไม่สามารถใช้งานได้ เป็นต้น
          สินค้าที่ไม่มีการ QC ได้แก่    -สินค้าที่ถูกห่อบรรจุไว้โดยวัสดุแข็งภายนอก เช่น ตีลัง
        -สินค้าบรรจุแบบสุญญากาศ
        -สินค้าจำพวกถุงพลาสติก / ถุงไปรษณีย์
        -สินค้าจำพวกผ้าม้วน / หญ้าเทียมม้วน
        -สินค้าจำพวกอะไหล่ สินค้า DIY  อุปกรณ์เสริมที่ได้รับจากสินค้า
        -ของแถมที่ทางผู้ขายส่งมาให้
        -โปสการ์ด / ต่างหู / โมเดลหุ่น
        -สินค้าฝากส่ง  (จะสุ่มเช็คว่าเป็นสินค้าประเภทไหนเท่านั้น )

        7.การแจ้งเคลมสินค้า กรณีลูกค้าได้รับสินค้าและพบปัญหาที่เกิดกับสินค้า กรุณาถ่ายรูปสินค้าพร้อมระบุรายละเอียดปัญหา และส่งคำร้องเรียนมาที่อีเมล์ cs@vcanbuy.com
        ระยะเวลาที่สามารถแจ้งเคลมสินค้าได้ คือ ภายใน 7 วันหลังจากสินค้าถึงโกดังไทย (ไม่รวมวันหยุดนักขัตฤกษ์) หากเกินระยะเวลาดังกล่าว ทางบริษัทฯ ขอสงวนสิทธิ์ไม่รับการร้องเรียนและการแจ้งเคลมสินค้า ดังนั้นลูกค้าควรทำการมารับสินค้าหรือทำการตัดชำระค่าขนส่งเพื่อให้สินค้าจัดส่งถึงลูกค้าได้โดยเร็ว เพื่อประโยชน์ของลูกค้าในการตรวจสอบสินค้าและแจ้งเคลมสินค้า
        สำหรับขั้นตอนในการตรวจสอบการร้องเรียนหรือการแจ้งเคลมสินค้า จะใช้เวลาโดยประมาณ 7-15 วันทำการ (ไม่รวมวันเสาร์-อาทิตย์ และ วันหยุดนักขัตฤกษ์) ระยะเวลาการตรวจสอบขึ้นอยู่กับปัญหาของแต่ละกรณีและระยะเวลาที่ทางร้านค้าจีนตอบกลับ สำหรับการรับผิดชอบทั้งหมดที่เกิดขึ้นจะขึ้นอยู่กับร้านค้าจีนเท่านั้น
        กรณีต้องมีการจัดส่งสินค้าไปยังร้านค้าจีนเพื่อเปลี่ยนสินค้า ลูกค้าต้องเป็นผู้รับผิดชอบค่าใช้จ่ายและดำเนินการในการจัดส่งสินค้าไปยังร้านค้าจีนด้วยตัวเอง และบริษัทฯ ไม่รับผิดชอบต่อความเสี่ยง หรือความล่าช้าใด ๆ ในการเปลี่ยนสินค้าทุกกรณี
        ทาง VCANBUY ไม่มีนโยบายจัดส่งสินค้าไปยังร้านค้าจีนเพื่อเปลี่ยนสินค้า เนื่องจาก VCANBUY เป็นเพียงผู้ช่วยสั่งซื้อสินค้าจากจีนมาไทย ไม่ได้เป็นเจ้าของสินค้า แต่ทางเราจะทำหน้าที่เป็นตัวกลางในการติดต่อประสานงานกับร้านค้าจีนเพื่อทำการเปลี่ยนสินค้าให้เท่านั้น

        8.ระยะเวลาการขนส่งสินค้าจะเป็นไปตามมาตรฐานของบริษัทฯ ซึ่งสามารถดูรายละเอียดเพิ่มเติมได้ที่หน้า “ ค่าขนส่งระหว่างประเทศจีน-ไทย ”        “ ระยะเวลาการสั่งซื้อและขนส่งสินค้า ”
        9.บริษัทฯ ไม่รับผิดชอบต่อความล่าช้าในการจัดส่งสินค้า ที่เกิดจากวันหยุดยาว สภาพอากาศ ภัยธรรมชาติ   ด่านตรวจเข้ม สงคราม การนัดหยุด  เป็นต้น แต่บริษัทฯ จะพยายามจัดส่งสินค้าให้ถึงมือลูกค้าโดยเร็วที่สุด

        10.ค่าขนส่งระหว่างประเทศที่เรียกเก็บ จะเทียบจากค่าขนส่งระหว่างประเทศที่คิดจากน้ำหนักปริมาตรของพัสดุเทียบกับน้ำหนักตามจริงของพัสดุ ซึ่งหากค่าขนส่งระหว่างประเทศแบบไหนสูงกว่าจะคิดตามแบบนั้น ๆ

        11.รูปภาพสินค้าของร้านค้าอาจแตกต่างจากสินค้าจริงที่ได้รับ เนื่องจากจะมีการตกแต่งภาพเพื่อให้สวยงาม ทำให้อาจได้รับสินค้าที่มีความแตกต่างหรือผิดเพี้ยนไปบ้าง และทางบริษัทฯ ไม่มีการรับผิดชอบตรงส่วนนี้แทนร้านค้าได้

        12.สำหรับบริการฝากส่งสินค้าระหว่างประเทศ ทางบริษัทฯ ขอสงวนสิทธิ์ในการสุ่มตรวจสินค้าเพื่อป้องกันการนำเข้าสินค้าต้องห้ามมายังประเทศไทย และหากเกิดปัญหากับสินค้าดังกล่าว ทางบริษัทฯ จะไม่รับผิดชอบต่อความเสียหายที่เกิดขึ้นทุกกรณี

        13.สินค้าที่จัดส่งมาโกดังจีนหากมีน้ำหนักมากกว่า 500 กก./กล่อง หรือ ปริมาตรสินค้ามีขนาดเกิน 2 คิวขี้นไป จะมีการเรียกเก็บค่ารถยก 500 หยวน หากลูกค้าไม่ยินดีจ่ายค่ารถยกเพิ่มเติม สามารถแจ้งเปลี่ยนเป็นจัดส่งทางเรือได้ หากมีค่าใช้จ่ายนี้จะมีเจ้าหน้าที่โทรสอบถามความยินยอมจากลูกค้าก่อนเสมอ

        14.หลังจากสินค้าถึงโกดังไทย ลูกค้าสามารถฝากสินค้าได้ไม่เกิน 7 วัน หากเกินระยะเวลาที่กำหนดจะเริ่มคิดค่าบริการตาม เงื่อนไขการฝากสินค้าและค่าเช่าพื้นที่คลังสินค้าของบริษัทฯ และหากสินค้าอยู่คงค้างโกดังไทยเกิน 60 วัน ทางบริษัทฯ ขอสงวนสิทธิ์ในการนำสินค้าขายทอดตลาดโดยไม่ต้องแจ้งให้ทราบล่วงหน้า
        15.กรณีลูกค้าชำระรายการสั่งซื้อแล้ว จะไม่สามารถเปลี่ยนแปลงหรือยกเลิกรายการสั่งซื้อได้ทุกกรณี

        16.บริษัทฯ ขอสงวนสิทธิ์ในการเปลี่ยนแปลงข้อตกลงและเงื่อนไขโดยไม่ต้องแจ้งให้ทราบล่วงหน้า

        17.หากลูกค้าทำการสั่งซื้อกับทางบริษัท จะถือว่าลูกค้ายินยอมและยอมรับในข้อตกลงต่างๆข้างต้นทุกประการ

        * วันทำการ  =  วันจันทร์-วันศุกร์ ไม่รวมวันหยุดนักขัตฤกษ์

        """
        label.textColor = UIColor.black
//        label.backgroundColor  = UIColor.green
        label.numberOfLines = 0

        //通过富文本来设置行间距
        let paraph = NSMutableParagraphStyle()
        //将行间距设置为28
        paraph.lineSpacing = 15
        paraph.firstLineHeadIndent = 20
        paraph.alignment = .left
        // 溢出省略
        paraph.lineBreakMode = .byTruncatingTail
        let attributes = [NSAttributedString.Key.font:UIFont.systemFont(ofSize: 15),
                          NSAttributedString.Key.paragraphStyle: paraph]
        label.attributedText = NSAttributedString(string: str, attributes: attributes)

        scrollView.addSubview(label)
        
    }
    
    @objc func backBtnAction() {
        print("click back button")
        let rootVC = UIApplication.shared.delegate as! AppDelegate
        let RootVC = RootViewController()
        rootVC.window?.rootViewController = RootVC
    }

}

